ednieuw/ESP32Communications/Old/ESP32Arduino_CommV021/ESP32Arduino_CommV021.ino
    case 'U':                                                                                 // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
       break;

    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        snprintf(sptext, sizeof(sptext), "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        snprintf(sptext, sizeof(sptext), "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter X ****");
      break;

    case 'Y':       
                 // function that will run > 1sec can be placed here                                                                                  // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case 'Z':                                                                                 // Start WPS
      if(len == 1) 
       {
        snprintf(sptext, sizeof(sptext), "**** Start WPS on your router");
        WiFi.onEvent(WiFiEvent);
        WiFi.mode(WIFI_STA);
        Tekstprintln("Starting WPS");
        wpsInitConfig();
        wpsStart();
       }
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Mem.MCUrestarted = 0;                                                                 // Reset MCUrestart counter to 0    
        Tekstprintlnf("Mem.MCUrestarted reset to 0");
        StoreStructInFlashMemory();
        Tekstprintln("\n*********\n ESP restarting\n*********\n");            
        ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
 
    case '#':                                                                                 // *** Empty *** 
        snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '$':                                                                                 // *** Empty *** 
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        snprintf(sptext, sizeof(sptext), "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;

     case '^':                                                                                 // *** Empty ***
       snprintf(sptext, sizeof(sptext), "**** No Use option . ****");
      break;

    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        if(GetNTPtime(false))  SetDS3231Time();                                               // Only set time in DS3231 if time is valid
        SetRTCTime();
        PrintAllClockTimes();
        sptext[0] =0 ;
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault &. ****");
      break;
 
    case '(':
      snprintf(sptext, sizeof(sptext), "**** No Use option . ****");     
      break;

    case ')':
      snprintf(sptext, sizeof(sptext), "**** No Use option . ****");     
      break;

    case '{':  
      if (Mem.UseRotary==3 || Mem.UseRotary==4)
       {
         StartIRLearning();                                                                   // Initializes learning mode,Resets all button data, Prompts for first button
         snprintf(sptext, sizeof(sptext), "Learning IR finished");
       }
      else snprintf(sptext, sizeof(sptext), "IR remote is OFF (Turn it on with H03 or H04 )\nOr no IR remote is installed");
      break;

    case '}':                                                                                 // *** Empty ***
      if(len == 1) 
        {
         Mem.Ringbufcnt = !Mem.Ringbufcnt;
         snprintf(sptext, sizeof(sptext), "Ring buffer counter is %s", Mem.Ringbufcnt ? "OFF" : "ON");
         lastminute = 99;                                                                        // Force a minute update
        } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault . ****");
      break;


   case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        snprintf(sptext, sizeof(sptext), "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter + ****");
      break;

    case '_':                                                                                 // NO USE
      if(len > 1 && len < 4) 
       {
        byte ff = (byte)InputString.substring(1, 3).toInt();
        snprintf(sptext, sizeof(sptext), "No use: %d", ff);
        Tekstprintln(sptext);
       }
      break;      

    case '=':                                                                                 // Print permanent Mem memory
      if(len == 1)  PrintMem(); 
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter = ****");
      break;     

    case '0': 
    case '1': 
    case '2':                                                             // Time entry compatibility mode
      if(len == 6)                                                        // The first digit of InputString is 0, 1 or 2
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 0, 2, 0, 23);
        timeinfo.tm_min  = (int)SConstrainInt(InputString, 2, 4, 0, 59);
        timeinfo.tm_sec  = (int)SConstrainInt(InputString, 4, 6, 0, 59);
        if(DS3231Installed)   SetDS3231Time();
        else snprintf(sptext, sizeof(sptext), "No external RTC module detected");
       }   
      else snprintf(sptext, sizeof(sptext), "**** Length fault. Enter Thhmmss ****");
      break;
  }
  Tekstprintln(sptext);
  StoreStructInFlashMemory();                                                                 // Update EEPROM
 }
InputString = "";
lastminute = 99;                                                                              // Force a minute update
}

//--------------------------------------------                                                //
// COMMON Print time input method
// Rotary, Membrane or IR-remote
//--------------------------------------------
void PrintTimeInputMethod(byte Im)
{
  char Method[20];
  switch(Im)
  {
    case 0: strcpy(Method, "None");            break;
    case 1: strcpy(Method, "Rotary");          break;
    case 2: strcpy(Method, "Membrane");        break;
    case 3: strcpy(Method, "Large IR-remote"); break;
    case 4: strcpy(Method, "Tiny Ir-remote");  break;     
   default: strcpy(Method, "Error");
  }
  sprintf(sptext, "Time inputMethod: %s", Method);
  Tekstprintln(sptext);
}
//--------------------------------------------                                                //
// COMMON Print permanent Mem memory
//--------------------------------------------
void PrintMem(void)
{
 PrintLine(35); 
 PrintHeaps(); 
 PrintAllMappings();                                                                          // Print the IR remote keys 
 Tekstprintlnf(" TurnOffLEDsAtHH: %d",Mem.TurnOffLEDsAtHH);                 
 Tekstprintlnf("  TurnOnLEDsAtHH: %d",Mem.TurnOnLEDsAtHH);                  
 Tekstprintlnf("  LanguageChoice: %d",Mem.LanguageChoice);                  
 Tekstprintlnf("    LightReducer: %d",Mem.LightReducer);                    
 Tekstprintlnf(" LowerBrightness: %d",Mem.LowerBrightness);                 
 Tekstprintlnf(" UpperBrightness: %d",Mem.UpperBrightness);                 
 for (int i=0;i<12;i++) { Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 for (int i=12;i<24;i++){ Tekstprintf("%03d ",Mem.NVRAMmem[i]); }   Tekstprintln("");
 Tekstprintlnf("   DisplayChoice: %d",Mem.DisplayChoice);                                                                                      
 Tekstprintlnf("           BLEOn: %s",Mem.BLEOn ? "ON" : "OFF");            
 Tekstprintlnf("           NTPOn: %s",Mem.NTPOn ? "ON" : "OFF");            
 Tekstprintlnf("          WIFIOn: %s",Mem.WIFIOn ? "ON" : "OFF");           
 Tekstprintlnf("     StatusLEDOn: %s",Mem.StatusLEDOn ? "ON" : "OFF");      
 Tekstprintlnf("    MCUrestarted: %d",Mem.MCUrestarted );                   
 Tekstprintlnf("    LoopRebooted: %d",Mem.LoopRebooted );                   
 Tekstprintlnf("    TimeReceiver: %s",Mem.TimeReceiver ? "ON" : "OFF"); 
 Tekstprintlnf("      TimeSender: %s",Mem.TimeSender ? "ON" : "OFF");  
 Tekstprintlnf("  Time log print: %s",Mem.TimeLogPrint == 0 ? "OFF" : 
                                      Mem.TimeLogPrint == 1 ? "Per minute" : 
                                      Mem.TimeLogPrint == 2 ? "Per hour" : "Undefined");      
 Tekstprintlnf("         DCF77On: %s",Mem.DCF77On  ? "ON" : "OFF");         
 Tekstprintlnf("   Mem.UseRotary: %d",Mem.UseRotary);                       
 PrintTimeInputMethod(Mem.UseRotary);
 Tekstprintlnf("       UseDS3231: %s",Mem.UseDS3231 ? "ON" : "OFF");        
 Tekstprintlnf("       LED strip: %s", Mem.LEDstrip?"WS2812":"SK6812" );    
 Tekstprintlnf("      FiboChrono: %s",Mem.FiboChrono ? "FIBO" : "CHRONO");  
 Tekstprintlnf("          NoExUl: %s", Mem.NoExUl ? "ON" : "OFF");          
 byte wc = Mem.WIFIcredentials; 
 Tekstprintlnf(" WIFIcredentials: %s", wc==0? "Not SET" : wc==1? "SET" : wc==2? "SET&OK": 
                                       wc==3? "in AP not SET":"Unknown code");
 Tekstprintlnf("      IntFuture2: %d",Mem.IntFuture2 );                                           
 Tekstprintlnf("      Ringbufcnt: %d",Mem.Ringbufcnt );                     
 Tekstprintlnf("     byteFuture3: %d",Mem.byteFuture3 );  
 Tekstprintlnf("     byteFuture4: %d",Mem.byteFuture4 );                       
 Tekstprintlnf("      HET IS WAS: %s", Mem.HetIsWasOff ? "OFF" : "ON");     
 Tekstprintlnf("       EDSOFT is: %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");    
 Tekstprintlnf("   RandomDisplay: %s", Mem.RandomDisplay? "ON" : "OFF");    
 Tekstprintlnf("WIFInoConnection: %d", Mem.WIFInoConnection);               
 Tekstprintlnf("UseBLELongString: %s",Mem.UseBLELongString?"ON":"OFF");     
 Tekstprintlnf("     Font colour: 0X%08" PRIX32, Mem.OwnColour);            
 Tekstprintlnf("    DimmedLetter: 0X%08" PRIX32,Mem.DimmedLetter);          
 Tekstprintlnf("      BackGround: 0X%08" PRIX32,Mem.BackGround);            
 Tekstprintlnf("            SSID: %s",Mem.SSID);                            
 // Tekstprintlnf("BackGround: %s",Mem.Password);                           
 Tekstprintlnf("BLEbroadcastName: %s",Mem.BLEbroadcastName);                
 Tekstprintlnf("        Timezone: %s",Mem.Timezone);                        
 Tekstprintlnf("        Checksum: %d",Mem.Checksum);                        
 sptext[0]=0;                                                                                 // Suppress a second print of sptext
}

//--------------------------------------------                                                //
// COMMON Print memory space
//--------------------------------------------
void StoredStartHeaps(){ StoredStartHeaps(false); }
void StoredStartHeaps(bool Store)
{
 static uint32_t a,b,c,d,e,f;
 if(Store)
   {
    a = ESP.getFreeHeap();
    b = heap_caps_get_largest_free_block(MALLOC_CAP_8BIT);
    c = esp_get_minimum_free_heap_size();
    d = heap_caps_get_free_size(MALLOC_CAP_8BIT);
    e = heap_caps_get_free_size(MALLOC_CAP_DMA);
    f = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
   }
  else
  {
  Tekstprintln("Heaps before allocation of the ringbuffer");
  Tekstprintlnf("         Free heap: %7.1f Kbytes", a / (1024.0  ));
  Tekstprintlnf("     Largest block: %7.1f Kbytes", b / (1024.0  ));
  Tekstprintlnf("     Min free heap: %7.1f Kbytes", c / (1024.0  ));
  Tekstprintlnf("8-bit capable heap: %7.1f Kbytes", d / (1024.0  ));
  Tekstprintlnf("  DMA capable heap: %7.1f Kbytes", e / 1024.0);
  Tekstprintlnf(" SPRAM/SPIRAM heap: %7.1f Kbytes", f / (1024.0  ));
  PrintLine(35);
  }
}
//--------------------------------------------                                                //
// COMMON Print memory space
//--------------------------------------------
void PrintHeaps(void)
{
 StoredStartHeaps();  
 Tekstprintln("Actual heap sizes");                                                           // Print the heaps before allocation
 Tekstprintlnf("         Free heap: %7.1f Kbytes", ESP.getFreeHeap() / (1024.0  ));
 Tekstprintlnf("     Largest block: %7.1f Kbytes", heap_caps_get_largest_free_block(MALLOC_CAP_8BIT) / (1024.0  ));
 Tekstprintlnf("     Min free heap: %7.1f Kbytes", esp_get_minimum_free_heap_size() / (1024.0  ));
 Tekstprintlnf("8-bit capable heap: %7.1f Kbytes", heap_caps_get_free_size(MALLOC_CAP_8BIT)   / (1024.0  ));
 Tekstprintlnf("  DMA capable heap: %7.1f Kbytes", heap_caps_get_free_size(MALLOC_CAP_DMA)    / 1024.0);
 Tekstprintlnf(" SPRAM/SPIRAM heap: %7.1f Kbytes", heap_caps_get_free_size(MALLOC_CAP_SPIRAM) / (1024.0  ));
}

//--------------------------------------------                                                //
// LDR reading are between 0 and 255. 
// ESP32 analogue read is between 0 - 4096 --   is: 4096 / 8
//--------------------------------------------
int ReadLDR(void)
{
 return analogRead(PhotoCellPin)/16;
}
//--------------------------------------------                                                //
// CLOCK Say the time and load the LEDs 
// with the proper colour and intensity
// If ClearLEDstrip is true a new minute starts
//--------------------------------------------
void Displaytime(void)
{ 
 ClearScreen();                                                                               // Start by clearing the display to a known state   
 GetTijd(true); //Tekstprintln(""); 
}
//--------------------------------------------                                                //
// CLOCK Dim the leds measured by the LDR and print values
// LDR reading are between 0 and 255. The Brightness send to the LEDs is between 0 and 255
//--------------------------------------------
void DimLeds(bool print) 
{ 
  int LDRread = ReadLDR();                                                                    // ESP32 analoge read is between 0 - 4096, reduce it to 0-1024                                                                                                   
  int LDRavgread = (4 * Previous_LDR_read + LDRread ) / 5;                                    // Read lightsensor and avoid rapid light intensity changes
  Previous_LDR_read = LDRavgread;                                                             // by using the previous reads
  OutPhotocell = (uint32_t)((Mem.LightReducer * sqrt(255*LDRavgread))/100);                   // Linear --> hyperbolic with sqrt. Result is between 0-255
  MinPhotocell = min(MinPhotocell, LDRavgread);                                               // Lowest LDR measurement
  MaxPhotocell = max(MaxPhotocell, LDRavgread);                                               // Highest LDR measurement
  OutPhotocell = constrain(OutPhotocell, Mem.LowerBrightness, Mem.UpperBrightness);           // Keep result between lower and upper boundery en calc percentage
  SumLDRreadshour += LDRavgread;    NoofLDRreadshour++;                                       // For statistics LDR readings per hour
   if(print)
   {
    PrintTimeHMS(1);  // No lf  
    if (Mem.UseDS3231) snprintf(sptext, sizeof(sptext),"LDR:%3d->%2d%% %3lu kl/s %0.0fC ",
                     LDRread,(int)(OutPhotocell*100/255),Loopcounter/1000,RTCklok.getTemperature()); 
    else               snprintf(sptext, sizeof(sptext),"LDR:%3d->%2d%% %3lu kl/s ",
                     LDRread,(int)(OutPhotocell*100/255),Loopcounter/1000);   
    if(TestLDR) Tekstprintln(sptext);
    else Tekstprint(sptext); 
    sptext[0] = 0;
   }
 if(LEDsAreOff) OutPhotocell = 0;
 SetBrightnessLeds(OutPhotocell);     // values between 0 and 255
}

// --------------------Colour Clock Light functions -----------------------------------
//--------------------------------------------                                                //
// LED Set color for LEDs in strip and print tekst
//---------------------------------------------
void ColorLeds(char const *Tekst, int FirstLed, int LastLed, uint32_t RGBWColor)
{ 
 Stripfill(RGBWColor, FirstLed, ++LastLed - FirstLed );                                        //
 if (!NoTextInLeds && !Mem.TimeLogPrint && strlen(Tekst) > 0 )
     { snprintf(sptext, sizeof(sptext),"%s ",Tekst); Tekstprint(sptext); }                                      // Print the text  
}
//--------------------------------------------
// LED Set color for one LED
//--------------------------------------------
void ColorLed(int Lednr, uint32_t RGBWColor)
{   
 Stripfill(RGBWColor, Lednr, 1 );
}
//--------------------------------------------                                                //
// LED Clear display settings of the LEDs
//--------------------------------------------
void LedsOff(void) 
{ 
 Stripfill(0, 0, NUM_LEDS );                                                                  // 
}
//--------------------------------------------                                                //
// LED Turn On and the LEDs off after Delaymsec milliseconds
//--------------------------------------------
void Laatzien(int Delaymsec) 
{ 
 ShowLeds(); 
 delay(Delaymsec);
 LedsOff(); 
 CheckDevices();                                                                              // Check for input from input devices
}

//--------------------------------------------                                                //
// LED Push data in LED strip to commit the changes
//--------------------------------------------
void ShowLeds(void) { LEDstrip.show(); }
//--------------------------------------------                                                //
// LED Set brighness of LEDs
//--------------------------------------------
void SetBrightnessLeds(byte Bright)
{
 LEDstrip.setBrightness(Bright);                                                              // Set brightness of LEDs   
 ShowLeds();
}
//--------------------------------------------
// LED Fill the strip array
//--------------------------------------------
void Stripfill(uint32_t RGBWColor, int FirstLed, int NoofLEDs)
{   
 LEDstrip.fill(RGBWColor, FirstLed, NoofLEDs);
}
//--------------------------------------------
// LED Strip Get Pixel Color 
//--------------------------------------------
uint32_t StripGetPixelColor(int Lednr)
{
 return(LEDstrip.getPixelColor(Lednr));
}
//--------------------------------------------                                                //
// LED Synchronize the colour of the LEDstrip with the Status LED
// Used during Setup(). if LEDcolour == 9999 -> clear the display
//--------------------------------------------
void LEDstartup(uint32_t LEDColour)
{
 static uint32_t ProgressLedNr = 0;
 if (LEDColour == CLEARLEDSTARTUP)  
    for(int n = ProgressLedNr-1; n>=0; n--)
      {
       ColorLed(n,0); 
       ShowLeds(); 
       delay(200);
      }
 else
   {
    ColorLed(ProgressLedNr++,LEDColour); 
    ShowLeds();   
    SetStatusLED(Cred(LEDColour),Cgreen(LEDColour),Cblue(LEDColour));  
   }
}

//--------------------------------------------                                                //
// LED convert HSV to RGB  h is from 0-360, s,v values are 0-1
// r,g,b values are 0-255
//--------------------------------------------
/**
 * @brief Convert HSV values to packed RGBW format (white = 0).
 * @param H Hue angle (0–360)
 * @param S Saturation (0–1)
 * @param V Value/Brightness (0–1)
 * @return Packed RGBW uint32_t value
 */
uint32_t HSVToRGB(double H, double S, double V) 
{
 int i;
 double r, g, b, f, p, q, t;
 if (S == 0)  {r = V;  g = V;  b = V; }
 else
  {
   H >= 360 ? H = 0 : H /= 60;
   i = (int) H;
   f = H - i;
   p = V * (1.0 -  S);
   q = V * (1.0 - (S * f));
   t = V * (1.0 - (S * (1.0 - f)));
   switch (i) 
    {
     case 0:  r = V;  g = t;  b = p;  break;
     case 1:  r = q;  g = V;  b = p;  break;
     case 2:  r = p;  g = V;  b = t;  break;
     case 3:  r = p;  g = q;  b = V;  break;
     case 4:  r = t;  g = p;  b = V;  break;
     default: r = V;  g = p;  b = q;  break;
    }
  }
return FuncCRGBW((int)(r*255), (int)(g*255), (int)(b*255), 0 );                                // R, G, B, W 
}
//--------------------------------------------                                                //
// LED function to make RGBW colour
//--------------------------------------------
uint32_t FuncCRGBW( uint32_t Red, uint32_t Green, uint32_t Blue, uint32_t White)
{ 
 return ( (White<<24) + (Red << 16) + (Green << 8) + Blue );
}
//--------------------------------------------                                                //
// LED functions to extract RGBW colours
//--------------------------------------------
 uint8_t Cwhite(uint32_t c) { return (c >> 24);}
 uint8_t Cred(  uint32_t c) { return (c >> 16);}
 uint8_t Cgreen(uint32_t c) { return (c >> 8); }
 uint8_t Cblue( uint32_t c) { return (c);      }


//--------------------------------------------                                                //
//  DISPLAY Clear the display
//--------------------------------------------
void ClearScreen(void)
{
 LedsOff();
}

//--------------------------------------------                                                //
// DISPLAY Initialyse the LEDstrip for WS2812 or SK6812 LEDs
//--------------------------------------------
void StartLeds(void) 
{
 switch (Mem.LEDstrip)
    {
      case 0: LEDstrip = LED6812strip; 
              white  = 0xFF000000; 
              lgray  = 0x66000000;  
              gray   = 0x33000000;                                                            // The SK6812 LED has a white LED that is pure white
              dgray  = 0x22000000;
              wgray  = 0xAA000000; 

      break;
      case 1: LEDstrip = LED2812strip; 
              white  = 0xFFFFFF;
              lgray  = 0x666666;                                                              // R, G and B on together gives white light
              gray   = 0x333333;
              dgray  = 0x222222;
              wgray  = 0xAAAAAA;         
      break;
     default: LEDstrip = LED6812strip;
              white  = 0xFF000000; 
              lgray  = 0x66000000;  
              gray   = 0x33000000;                                                            // The SK6812 LED has a white LED that is pure white
              dgray  = 0x22000000; 
              wgray  = 0xAA000000;     
    }
snprintf(sptext, sizeof(sptext),"LED strip is %s", Mem.LEDstrip?"WS2812":"SK6812" ); Tekstprintln(sptext);
LEDstrip.begin();
LEDstrip.setBrightness(16);  
LedsOff();                                                                                    // Set initial brightness of LEDs  (0-255)  
ShowLeds();
}

